
def area(a):
    '''
    Принимает число a - длина стороны квадрата.
    
    Возвращает число - значение площади данного квадрата.
    '''
    return a * a


def perimeter(a):
    '''
    Принимает число a - длина стороны квадрата.
    
    Возвращает число - значение периметра данного квадрата.
    '''
    return 4 * a


def diagonal(a):
    '''
    Принимает число a - длина стороны квадрата.
    
    Возвращает число - значение длины диагонали данного квадрата.
    '''
    return a * (2 ** 0.5)